app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)
    if @house.save
---
INSERT INTO "houses" ("name", "author", "source", "motto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"