app/controllers/members_controller.rb

  def create
      @house = House.find(params[:house_id])
      @member = Member.new(member_params)
      @member.house = @house

      if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Edmure"], ["last_name", "Tully"], ["house_id", 47], ["created_at", "2018-04-19 21:54:51.743273"], ["updated_at", "2018-04-19 21:54:51.743273"]]